src/DataProcessors/Scan_РаспределениеЗаявок/Scan_РаспределениеЗаявок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>Scan_РаспределениеЗаявок</name>
</mdclass:DataProcessor>

src/Catalogs/Scan_МестаХранения/Scan_МестаХранения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Scan_МестаХранения</name>
  <comment>Места хранения (отгрузки, доставки)</comment>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>Маршруты</name>
      <description>Маршруты</description>
    </items>
    <items>
      <name>МестаХраненияАдресаКлиентов</name>
      <description>Места хранения – адреса клиентов</description>
    </items>
    <items>
      <name>МестаХранения</name>
      <description>Места хранения (площадки)</description>
    </items>
  </predefined>
  <attributes>
    <name>IDExternalSystem</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресСкладаЛогистический</name>
    <type>
      <types>CatalogRef.Scan_АдресаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресСкладаФактический</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БуквенныйКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОбновления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗарубежныйКузовостроитель</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсходныйПункт</name>
    <type>
      <types>CatalogRef.Scan_МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПродуктовНаПлощадке</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонечныйПункт</name>
    <type>
      <types>CatalogRef.Scan_МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Scan_Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>КраткоеНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Маршрут</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Недействительный</name>
    <comment>Место хранения больше не используется в программе, но сведения о нем сохранены. Недействительные места хранения скрываются из всех списков при выборе или подборе в документах, и других местах программы.</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверятьНаличиеВ1БД</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладПроизводителя</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтанцияДилера</name>
    <type>
      <types>CatalogRef.Scan_Компании</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипСклада</name>
    <type>
      <types>EnumRef.Scan_ТипыСклада</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормироватьЧекЛисты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоИспользований</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>11</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НеЗапрещатьПеремещениеМестаХранения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СрокиДоставки</name>
    <attributes>
      <name>СрокДоставки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СпособДоставки</name>
      <type>
        <types>EnumRef.Scan_СпособыДоставкиПродуктов</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/Scan_КонтактныеЛица/Scan_КонтактныеЛица.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Scan_КонтактныеЛица</name>
  <owners>Catalog.Scan_Контрагенты</owners>
  <owners>Catalog.Scan_Компании</owners>
  <owners>Catalog.Scan_Сотрудники</owners>
  <attributes>
    <name>IDExternalSystem</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидКонтактногоЛица</name>
    <type>
      <types>EnumRef.Scan_ВидыКонтактныхЛиц</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОбновления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДилерскаяСтанция</name>
    <type>
      <types>CatalogRef.Scan_Компании</types>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Scan_Должности</types>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Недействителен</name>
    <comment>Контактное лицо больше не используется в программе, но сведения о нем сохранены. Недействительные контактные лица скрываются из всех списков при выборе или подборе в документах, и других местах программы.</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтправлятьДетализированныйАкт</name>
    <comment>#15689</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтправлятьПисьмаНапоминанияПоДоставкеИзделий</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтправлятьПисьмаНапоминанияПоДоставкеИзделийПовторно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтправлятьПисьмаОбОтклоненияхПоКлючевымДатамЗаказовНаЗавод</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтправлятьПисьмоСОтчетомDeliveriesReport</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтправлятьПФЗаявкиНаДействие</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтправлятьПФЗаявкиНаСервисныеРаботы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтправлятьПФЗаявкиПеревозчику</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтправлятьПФМ15</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтправлятьПФМХ1МХ3</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтправлятьПФМХ3</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтправлятьЧекЛистПроверкиТехсостояния</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Отчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Фамилия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/DataProcessors/Scan_РаспределениеЗаявок/Forms/ФормаКорректировкиЗаявкиНаДействие/Module.bsl
//rarus sergei 09.09.2016 mantis 7167 ++
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЭтаФорма.АвтоЗаголовок = ЛОЖЬ;
	ЗаявкаНаДействие = Параметры.ЗаявкаНаДействие;
	ЭтаФорма.Заголовок = "Корректировка Заявки на Действие "+ ЗаявкаНаДействие;
	МестоДоставки = Параметры.ЗаявкаНаДействие.МестоДоставки;
	ДатаДоставкиПлановая = Параметры.ЗаявкаНаДействие.ДатаДоставкиПлановая;
	СпособДоставки = Параметры.ЗаявкаНаДействие.СпособДоставки;
	ПриемВВыходныеИПраздничные = Параметры.ЗаявкаНаДействие.ПриемВВыходныеИПраздничные;
	Грузополучатель = Параметры.ЗаявкаНаДействие.Грузополучатель;
	Договор = Параметры.ЗаявкаНаДействие.Договор;
	Для каждого строка Из Параметры.ЗаявкаНаДействие.КонтактныеЛица Цикл
		НоваяСтрока = КонтактныеЛица.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,строка);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура МестоДоставкиПриИзменении(Элемент)
	МестоДоставкиПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура МестоДоставкиПриИзмененииНаСервере()
	Если (НЕ ЗначениеЗаполнено(Грузополучатель) ИЛИ Грузополучатель <> МестоДоставки.Контрагент) И
		НЕ МестоДоставки.Пустая() Тогда
		Грузополучатель = МестоДоставки.Контрагент;
		ГрузополучательПриИзмененииНаСервере();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура МестоДоставкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
			
	//Если ЗначениеЗаполнено(Объект.МодельПродукта) Тогда	
		СтандартнаяОбработка = Ложь;
		ЗначениеОтбора = Новый Структура("Маршрут", ЛОЖЬ);
		Если ЗначениеЗаполнено(Грузополучатель) Тогда
			ЗначениеОтбора.Вставить("Контрагент",Грузополучатель);
		КонецЕсли;
		ПараметрыФормы = Новый Структура("Отбор", ЗначениеОтбора);
	    Результат = ОткрытьФорму("Справочник.Scan_МестаХранения.ФормаВыбора",ПараметрыФормы,Элементы.МестоДоставки); 
	//КонецЕсли;
	

КонецПроцедуры

&НаКлиенте
Процедура ГрузополучательПриИзменении(Элемент)
	ОчиститьМестоДоставки();
	ГрузополучательПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОчиститьМестоДоставки()
	МестоДоставки = Справочники.Scan_МестаХранения.ПустаяСсылка();	
КонецПроцедуры


&НаСервере
Процедура ГрузополучательПриИзмененииНаСервере()
	Если ЗначениеЗаполнено(Договор) и Грузополучатель <> Договор.Владелец Тогда 
		
		Договор = Справочники.Scan_ДоговорыВзаиморасчетов.ПустаяСсылка();
		КонтактныеЛица.Очистить();				
	
	КонецЕсли; 

КонецПроцедуры

&НаКлиенте
Процедура ДоговорПриИзменении(Элемент)
	ДоговорПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ДоговорПриИзмененииНаСервере()
	//rarus pechek 03.04.2020 mantis 15672 +++
	//Если ЗначениеЗаполнено(Договор) Тогда
	//Для каждого строка Из Договор.КонтактныеЛицаПоДоговору Цикл
	//	МассивНайденныхСтрок = КонтактныеЛица.НайтиСтроки(Новый Структура("КонтактноеЛицо",строка.КонтактноеЛицо));
	//	
	//	Если МассивНайденныхСтрок.Количество()= 0 Тогда
	//		ЗаполнитьКонтактнуюинформацию(строка.КонтактноеЛицо);
	//	КонецЕсли;	
	//КонецЦикла;  					
	//КонецЕсли;
	//rarus pechek 03.04.2020 mantis 15672 ---
	Если ЗначениеЗаполнено(Грузополучатель) и Договор.Пустая() Тогда
		ГрузополучательПриИзмененииНаСервере()	
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКонтактнуюинформацию(парам)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Scan_КонтактныеЛицаКонтактнаяИнформация.Ссылка КАК КонтактноеЛицо,
	               |	Scan_КонтактныеЛицаКонтактнаяИнформация.Вид КАК ВидКонтактнойИнформации,
	               |	Scan_КонтактныеЛицаКонтактнаяИнформация.Представление КАК Представление
	               |ИЗ
	               |	Справочник.Scan_КонтактныеЛица.КонтактнаяИнформация КАК Scan_КонтактныеЛицаКонтактнаяИнформация
	               |ГДЕ
	               |	Scan_КонтактныеЛицаКонтактнаяИнформация.Ссылка.Ссылка = &Ссылка
	               |	И (Scan_КонтактныеЛицаКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)
	               |			ИЛИ Scan_КонтактныеЛицаКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты))";
				  
	Запрос.УстановитьПараметр("Ссылка",парам);
	ТЗ=Запрос.Выполнить().Выгрузить();
	Для каждого строкаТЗ Из ТЗ Цикл 
		
		НоваяСтрока=КонтактныеЛица.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,строкаТЗ);
	    
	КонецЦикла; 
	Если НЕ ЗначениеЗаполнено(Грузополучатель) Тогда 
		Грузополучатель = Парам.Владелец;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДоговорНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Грузополучатель) Тогда			
		СтандартнаяОбработка = Ложь;
		ЗначениеОтбора = Новый Структура("Владелец", Грузополучатель);
		ПараметрыФормы = Новый Структура("Отбор", ЗначениеОтбора);
	    ПараметрыФормы.Вставить("Грузополучатель", Грузополучатель);			
		Результат = ОткрытьФорму("Справочник.Scan_ДоговорыВзаиморасчетов.ФормаВыбора",ПараметрыФормы,Элементы.Договор); 
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ДоговорСоздание(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПараметрыСоздания = Новый Структура;
	ПараметрыСоздания.Вставить("Владелец", Грузополучатель);
	ПараметрыСоздания.Вставить("Наименование",Элемент.ТекстРедактирования);  
	ОткрытьФорму("Справочник.Scan_ДоговорыВзаиморасчетов.ФормаОбъекта", ПараметрыСоздания, Элемент);

КонецПроцедуры

&НаКлиенте
Процедура КонтактныеЛицаКонтактноеЛицоНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Объект.Грузополучатель) Тогда
	
		СтандартнаяОбработка = Ложь;
		ЗначениеОтбора = Новый Структура("Владелец", Грузополучатель);
		ПараметрыФормы = Новый Структура("Отбор", ЗначениеОтбора);
	    Результат = ОткрытьФорму("Справочник.Scan_КонтактныеЛица.ФормаВыбора",ПараметрыФормы,Элементы.КонтактныеЛицаКонтактноеЛицо); 
	
	
	КонецЕсли; 

КонецПроцедуры

&НаКлиенте
Процедура КонтактныеЛицаКонтактноеЛицоОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	МассивСтрок=КонтактныеЛица.НайтиСтроки(Новый Структура("КонтактноеЛицо",ВыбранноеЗначение));
	Если МассивСтрок.Количество()> 0 и МассивСтрок[0].НомерСтроки <>  ТекущийЭлемент.ТекущаяСтрока+1 Тогда
		СтандартнаяОбработка=Ложь;              
		Возврат; 
	КонецЕсли;
	СтандартнаяОбработка = Ложь;
	ИндексТекущейСтроки = КонтактныеЛица.Индекс(Элементы.КонтактныеЛица.ТекущиеДанные);
	КонтактныеЛица.Удалить(ИндексТекущейСтроки);  
	ЗаполнитьКонтактнуюинформацию(ВыбранноеЗначение);

КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();

КонецПроцедуры

&НаКлиенте
Процедура Ок(Команда)
	ПараметрыЗакрытия = Новый Структура;
	ПараметрыЗакрытия.Вставить("ЗаявкаНаДействие",ЗаявкаНаДействие);
	ПараметрыЗакрытия.Вставить("МестоДоставки",МестоДоставки);
	ПараметрыЗакрытия.Вставить("ДатаДоставкиПлановая",ДатаДоставкиПлановая);
	ПараметрыЗакрытия.Вставить("СпособДоставки",СпособДоставки);
	ПараметрыЗакрытия.Вставить("ПриемВВыходныеИПраздничные",ПриемВВыходныеИПраздничные);
	ПараметрыЗакрытия.Вставить("Грузополучатель",Грузополучатель);
	ПараметрыЗакрытия.Вставить("Договор",Договор);
	ПараметрыЗакрытия.Вставить("КонтактныеЛица",КонтактныеЛица);
                        
	Закрыть(ПараметрыЗакрытия);

КонецПроцедуры
//rarus sergei 09.09.2016 mantis 7167 --
